tasks/04-conf/src/Configuration/CalculationRegisters/ОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

tasks/04-conf/src/Configuration/CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтавкаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

tasks/04-conf/src/Configuration/CommonModules/ЗаписьРасчетов/Ext/Module.bsl
Процедура ЗаписатьОсновныеНачисления(НаборЗаписей, Регистратор) Экспорт
	
	// ===== РАСЧЕТ ОСНОВНЫХ НАЧИСЛЕНИЙ (ОКЛАД ПРОПОРЦИОНАЛЬНО ОТРАБОТАННОМУ ВРЕМЕНИ) =====
	// Расчет оклада пропорционально фактически отработанным часам/дням
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноЧасов,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихЧасов,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеДнейФактическийПериодДействия, 0) КАК ОтработаноДней,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеДнейПериодДействия, 0) КАК РабочихДней
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика";
	
	// Получаем фактические и плановые показатели графика работы
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Расчет суммы начисления для каждого сотрудника
	Для Каждого Движение Из НаборЗаписей Цикл
		// Находим данные графика по номеру строки
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
		
		// Формула расчета: (Оклад / РабочихЧасов) * ОтработаноЧасов
    		// Защита от деления на ноль для сотрудников с нулевым графиком
		Движение.Результат = ?(Выборка.РабочихЧасов <> 0,
							   Движение.Оклад / Выборка.РабочихЧасов * Выборка.ОтработаноЧасов,
							   0);
							   
		// Сохраняем расчетные показатели для анализа и отчетности
		ЗаполнитьЗначенияСвойств(Движение, Выборка, "РабочихЧасов, ОтработаноЧасов, РабочихДней, ОтработаноДней");
	КонецЦикла;
	
	// Записываем результаты расчета в регистр
	НаборЗаписей.Записать(, Истина);
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеНачисления(НаборЗаписей, Регистратор, ДопОтбор = Неопределено) Экспорт
	
	// ===== РАСЧЕТ ДОПОЛНИТЕЛЬНЫХ НАЧИСЛЕНИЙ (КОМПЕНСАЦИИ ПО СТАВКЕ) =====
	// Расчет компенсаций на основе отработанных дней и фиксированной ставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ДополнительныеНачисленияБазаОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДней
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Регистратор И &ДопОтбор) КАК ДополнительныеНачисленияБазаОсновныеНачисления
		|		ПО ДополнительныеНачисления.НомерСтроки = ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки";
	
	// Определяем измерения для связи с основными начислениями
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Измерения.Добавить("Подразделение");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	// Гибкая настройка отбора: либо все строки, либо по заданному фильтру
	Если ДопОтбор = Неопределено Тогда
		// Если дополнительный отбор не задан, выбираем все записи
		Запрос.УстановитьПараметр("ДопОтбор", Истина);
	Иначе
		 // Динамически формируем условие отбора
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопОтбор", "(Сотрудник, Подразделение) В (&ДопОтбор)");
		Запрос.УстановитьПараметр("ДопОтбор", ДопОтбор);
	КонецЕсли;
	
	// Получаем ставку компенсации из константы (единая для всех расчетов)
	СтавкаКомпенсации = Константы.СтавкаКомпенсации.Получить();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Расчет компенсации для каждого сотрудника
	Для Каждого Движение Из НаборЗаписей Цикл
		
		// Находим количество отработанных дней по номеру строки
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
		
		// Формула расчета: СтавкаКомпенсации * ОтработаноДней
    		// Позволяет легко менять ставку без перерасчета истории
		Движение.Результат = СтавкаКомпенсации * Выборка.ОтработаноДней;
		
		// Сохраняем компоненты расчета для прозрачности и аудита
		Движение.СтавкаКомпенсации = СтавкаКомпенсации;
		Движение.ОтработаноДней = Выборка.ОтработаноДней;
		
	КонецЦикла;
	
	// Записываем результаты расчета в регистр
	НаборЗаписей.Записать();
	
КонецПроцедуры
